/*-------------------------------------------------------------------------------
 * 创建者：huangyechuan
 * 修改者列表：
 * 创建日期：2018/11/28
 * 模块描述：设备接口
 * 
 * ------------------------------------------------------------------------------*/

namespace LT
{
    /// <summary>
    /// 设备接口
    /// </summary>
    public interface IDevice
    {
        /// <summary>
        /// 手柄id
        /// </summary>
        int Hid { get; }

        /// <summary>
        /// 轮询
        /// </summary>
        void Update();
    }
}